#define _CRT_SECURE_NO_WORINGS
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>
//int main()
//{
//	//unsigned char -1个字节 - 8bit位
//	// 0-255
//	//00000000 - 0
//	//00000001 - 1
//	//...
//	//11111111 - 255
//	unsigned char a = 200;//无符号数，高位补0
//	unsigned char b = 100;
//	unsigned char c = 0;
//
//	c = a + b;//整形提升
//	//00000000000000000000000011001000
//	//11001000 - a
//	//00000000000000000000000001100100
//	//01100100 - b
//	//00000000000000000000000100101100 - a+b
//	//00101100 - c要以整形打印出来
//	//00000000000000000000000000101100
//	printf("%d,%d", a + b, c);
//
//	return 0;
//
//}

//int main()
//{
//	//-128 --> 127
//	char a[1000] = { 0 };
//
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//
//	//-1 -2 -3....-128 127 126 125 .... 3 2 1 0 -1 -2...
//
//	printf("%d\n", strlen(a));//255
//	return 0;
//}

//打印杨辉三角
//      1
//     1 1
//    1 2 1
//   1 3 3 1
//  1 4 6 4 1
// .............
//int main()
//{
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j < 10; j++)
//		{
//			if (j == 0)
//			{
//				arr[i][j] = 1;
//			}
//			if (i == j)
//			{
//				arr[i][j] = 1;
//			}
//			if (i >= 2 && j >= 1)
//			{
//				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//			}
//		}
//	}
//	//打印
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%d ", arr[i][j]);
//			
//		}
//		printf("\n");
//	}
//	return 0;
//}

//猜凶手
//四个嫌疑人的供词
//A说：不是我
//B说：是C
//C说：是D
//D说：C在胡说
//已知三个人说了真话，一个人说了假话

//int main()
//{
//	int k = 0;
//	for (k = 'a'; k <= 'd'; k++)
//	{
//		if ((k != 'a') + (k == 'c') + (k == 'd') + (k != 'd') == 3)
//		{
//			printf("k=%c", k);
//		}
//	}
//	return 0;
//}

int main()
{
	return 0;
}