#define _CRT_SECURE_NO_WORINGS
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//int main()
//{
//	//输出什么
//	char a = -1;
//	//10000000000000000000000000000000001
//	//11111111111111111111111111111111110
//	//11111111111111111111111111111111111
//	//只存8个bit位11111111
//	signed char b = -1;
//	//11111111
//	//和a一回事
//
//	unsigned char c = -1;
//	//11111111
//	//整型提升
//	//00000000000000000000000011111111
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1,-1,255
//	//-1 -1 255
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000-补码
//	//10000000(放八个bit位)
//	//按照符号位整型提升
//	//11111111111111111111111110000000-补码
//	//无符号数的内存存的是补码，补码又和原码相同
//	//补码减一得到反码，反码符号位不变，其它位取反得到原码
//
//
//	printf("%u\n", a);//
//
//	//%d，打印十进制的有符号数字
//	//%u，打印十进制的无符号数字
//	//有符号char的范围是：-128-->127
//	//无符号char的范围是：0-->255
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	//按照补码的形式进行运算，最后格式化成为有符号的整数
//
//
//	return 0;
//}

//#include <windows.h>
//int main()
//{
//	unsigned int i;//无符号数字永远不可能小于零
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n",i);
//		Sleep(100);
//	}
//
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)//无符号char的范围是0-->255,后面再增加还是在0-255之间循环
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//unsigned char i = 0; //无符号char的范围是0-- > 255,循环不会停止
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}