#define _CRT_SECURE_NO_WORINGS
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//int main()
//{
//
//	int a = 20;//4个字节-32bit
//	//00000000000000000000000000010100 - 原码
//	//00000000000000000000000000010100 - 反码
//	//00000000000000000000000000010100 - 补码
//
//	int b = -10;
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//11111111111111111111111111110110 - 补码
//	return 0;
//}
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	//返回1，小端
//	//返回0，大端
//	
//	return *p;
//}
////指针类型的意义：
////指针类型决定了指针解引用操作符能访问几个字节：char* p；*p 访问了一个字节，int*p；*p 访问四个字节
////指针类型决定了指针+1，-1，加的或减的是几个字节；char*p;p+1,跳过一个字符，int
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	/*int a = 20;*/
//	/*0x 00 00 00 14
//
//		小端：
//		14 00 00 00
//
//		大端：
//		00 00 00 14*/
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

